
## Plan Result




<pre><code>Plan: 1 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_connection_string
* Update
  * azurerm_resource_group.rg
  * module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.storage_account.azurerm_storage_account.storage_account
  * module.storage_account_rd_commondata.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat"
      + name           = "app-insights-connection-string"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat"
        name     = "rd-aat"
      ~ tags     = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#referencedata"
          - "Team Name"    = "ReferenceData"
          - "environment"  = "aat"
          - "lastUpdated"  = "2022-08-24T10:12:22Z"
          - "managedBy"    = "ReferenceData"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat|rd-aat"
        name                       = "rd-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (1 unchanged block hidden)
    }

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdaat"
        name                              = "rdaat"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/rd-shared-infrastructure.git"
            "Deployment Environment" = "aat"
            "Destroy Me"             = "No"
            "Team Contact"           = "#referencedata"
            "application"            = "reference-data"
            "businessArea"           = "CFT"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#ref-data-support"
            "environment"            = "staging"
            "managedBy"              = "Reference Data"
        }
        # (33 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              - "82.25.248.223",
            ]
            # (3 unchanged attributes hidden)
        }


        # (3 unchanged blocks hidden)
    }

  # module.storage_account_rd_commondata.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdcommondataaat"
        name                              = "rdcommondataaat"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/rd-shared-infrastructure.git"
            "Deployment Environment" = "aat"
            "Destroy Me"             = "No"
            "Team Contact"           = "#referencedata"
            "application"            = "reference-data"
            "businessArea"           = "CFT"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#ref-data-support"
            "environment"            = "staging"
            "managedBy"              = "Reference Data"
        }
        # (33 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              - "147.12.193.20",
            ]
            # (3 unchanged attributes hidden)
        }


        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 4 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds has been changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat|rd-aat"
        name                       = "rd-aat"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
        # (1 unchanged block hidden)
    }
  # module.storage_account_rd_commondata.azurerm_storage_account.storage_account has been changed
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdcommondataaat"
        name                              = "rdcommondataaat"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/rd-shared-infrastructure.git"
            "Deployment Environment" = "aat"
            "Destroy Me"             = "No"
            "Team Contact"           = "#referencedata"
            "application"            = "reference-data"
            "businessArea"           = "CFT"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#ref-data-support"
            "environment"            = "staging"
            "managedBy"              = "Reference Data"
        }
        # (33 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              + "147.12.193.20",
            ]
            # (3 unchanged attributes hidden)
        }


        # (3 unchanged blocks hidden)
    }
  # module.storage_account.azurerm_storage_account.storage_account has been changed
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdaat"
        name                              = "rdaat"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/rd-shared-infrastructure.git"
            "Deployment Environment" = "aat"
            "Destroy Me"             = "No"
            "Team Contact"           = "#referencedata"
            "application"            = "reference-data"
            "businessArea"           = "CFT"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#ref-data-support"
            "environment"            = "staging"
            "managedBy"              = "Reference Data"
        }
        # (33 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              + "82.25.248.223",
            ]
            # (3 unchanged attributes hidden)
        }


        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":149,"Program":"tfcmt","SHA1":"","Vars":{}} -->